Revit 2027 API
FailureMessageKey.IsEqual Method
 Checks it this key is equal to the other.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	FailureMessageKey other
)
Public Function IsEqual (
	other As FailureMessageKey
) As Boolean
public:
bool IsEqual(
	FailureMessageKey^ other
)
member IsEqual :
        other : FailureMessageKey -> bool
Parameters
other FailureMessageKey
 The key to compare with.
Return Value
Boolean
 True if keys are equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FailureMessageKey Class
Autodesk.Revit.DB Namespace